Revit 2024 API
ContentNode Methods
The ContentNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAsset
 Returns an an instance of an Asset object, which contains definitions of the content node.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetTransform
 A transformation matrix associated with the node.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ContentNode Class
Autodesk.Revit.DB Namespace